Repository: doubleden/RustQuiz
Catalog: RustQuiz/Localization/Localizable.xcstrings
Source language: en
Languages: ru

source: _ covers the None case. Safe Option handling
ru: покрывает корпус None. Безопасное Option обращение

source: _ ignores the value and matches anything. Closes remaining cases
ru: _ игнорирует значение и соответствует чему угодно. Закрывает оставшиеся случаи

source: _ is a wildcard pattern that matches any value but doesn't bind it to a variable
ru: _ - это шаблон, который соответствует любому значению, но не привязывает его к переменной

source: _ is faster
ru: _ быстрее

source: _ underscore
ru: _ подчеркивание

source: _x binds the value and can take ownership, _ doesn't bind at all
ru: _x связывает значение и может принимать право собственности, _ не связывает вообще

source: _x binds value (can take ownership), _ doesn't bind
ru: _x связывает значение (может стать владельцем), _ не связывает

source: _x is a compilation error
ru: _x - ошибка компиляции

source: --cap-lints=warn turns all deny lint errors into warnings
ru: --cap-lints=warn превращает все ошибки deny lint в предупреждения

source: -> Type + tail expression
ru: -&gt; Тип + хвостовое выражение

source: – this is a comment
ru: - это комментарий

source: ; turns it into a statement
ru: ; превращает его в заявление

source: ? is only available when returning Result
ru: доступен только при возвращении Result

source: ? is shorter and does the same (unwrap Ok, return Err)
ru: ? короче и делает то же самое (развернуть Ok, return Err )

source: ? is slower
ru: ? медленнее

source: ? is syntactic sugar
ru: ? это синтаксический сахар

source: ? returns early with Err(...); the function must return a compatible type
ru: ? возвращается раньше времени с Err(...); функция должна return совместимой type

source: ? uses From::from(err) to coerce errors
ru: использует From::from(err) для принудительного устранения ошибок

source: ?Sized means type may or may not be Sized, relaxing default requirement
ru: ?Sized означает, что type может быть или не быть Sized, ослабляя требование по умолчанию

source: .. ignores remaining parts of value that weren't explicitly matched
ru: ... игнорирует оставшиеся части значения, которые не были явно сопоставлены

source: .. in the pattern
ru: ... in шаблон

source: ..= creates an inclusive range (e.g., 1..=5 includes 5)
ru: ..= создает инклюзивный диапазон (например, 1..=5 включает 5)

source: ..user1 copies the remaining fields. Built-in Rust syntax
ru: ...user1 копирует оставшиеся поля. Встроенный синтаксисin Rust

source: .bytes() yields u8
ru: .bytes() дает u8

source: .chars() iterates Unicode scalar values
ru: .chars() выполняет итерацию скалярных значений Юникода

source: 'static data
ru: 'static данные

source: 'static is automatically substituted
ru: 'static автоматически заменяется

source: 'static is required for data used by thread
ru: 'static требуется for данные, используемые потоком

source: "Communicate by sharing memory"
ru: "Общайтесь, делясь воспоминаниями"

source: "Don't share memory to communicate; communicate to share memory"
ru: "Не делитесь памятью, чтобы общаться; общайтесь, чтобы делиться памятью"

source: "If it walks like a duck and quacks like a duck, it's a duck" — checking by behavior
ru: "Если ходит как утка и крякает как утка, значит, это утка" - проверка по поведению

source: "If Ok — unwrap; if Err — return from the function"
ru: "Если Ok - развернуть; if Err - return от функции"

source: "Let the caller decide."
ru: "Пусть звонящий сам решает"

source: "Only mutexes — only hardcore"
ru: "Только мьютексы - только хардкор"

source: "Use global variables"
ru: "Используйте глобальные переменные"

source: (Sender<T>, Receiver<T>)
ru: (Отправитель<T>, Получатель<T>)

source: [] indexing panics on out-of-bounds
ru: [] индексирование паникует при выходе за пределы границ

source: @ allows binding value to variable while simultaneously checking pattern
ru: @ позволяет привязать значение к переменной while, одновременно проверяя шаблон

source: * imports all public items from a module
ru: * импортирует все публичные элементы из модуля

source: * is commonly used in a tests module
ru: * обычно используется in модуль тестов

source: * pulls in all public items of the module
ru: * вытягивает in все публичные элементы модуля

source: * wildcard
ru: * подстановочный знак

source: /* */ — multi-line (including nested)
ru: /* */ - многострочные (в том числе вложенные)

source: // — single line
ru: // - одна строка

source: // this is a comment
ru: // это комментарий

source: &'static str → usize without shadowing is invalid. mut does not change type
ru: &amp;'static str → usize без тени недействительно. mut не изменяется type

source: &'static struct
ru: &amp;'static struct

source: &[T]
ru: &amp;[T]

source: &a
ru: &amp;a

source: &Box<T>
ru: &ampBox<T>

source: &CStr
ru: &amp;CStr

source: &CStr is the borrowed version of C strings, allowing safe and efficient operations
ru: &amp;CStr - это заимствованная версия строк языка C, позволяющая выполнять безопасные и эффективные операции

source: &Item
ru: &amp;Item

source: &mut Box<T>
ru: &ampmut Box<T>

source: &mut str
ru: &ampmut str

source: &mut T
ru: &amp;mut T

source: &mut T → &T
ru: &amp;mut T → &amp;T

source: &mut T can be shared between threads
ru: &amp;mut T может быть разделен между потоками

source: &mut v yields &mut T; use * to mutate the value
ru: &amp;mut v yields &amp;mut T; use * для изменения значения

source: &mut Vec<T>
ru: &ampmut Vec<T>

source: &s[0..2]
ru: &amp;s[0..2]

source: &s[0..4]
ru: &amp;s[0..4]

source: &self is sugar for self: &Self. It borrows
ru: &amp;self - это сахар for self : &amp;Self. Он заимствует

source: &str
ru: &ampstr

source: &str can automatically become &String
ru: &amp;str может автоматически become &ampString

source: &str cannot be implicitly converted to &String because it would require allocation which is not automatic
ru: &amp;str не может быть неявно преобразовано в &amp;String, поскольку это потребует выделения, которое не является автоматическим

source: &str has .to_string()
ru: &amp;str имеет функцию .to_string()

source: &str is a slice, String is an owning buffer - different memory models
ru: &amp;str - фрагмент, String - собственный буфер - разные модели памяти

source: &str is always on the heap
ru: &amp;str всегда на куче

source: &str is an immutable slice; String owns and mutably manages heap data
ru: &amp;str - это неизменяемый фрагмент; String владеет и мутабельно управляет данными кучи

source: &str slices
ru: &amp;str ломтики

source: &String
ru: &ampString

source: &String can automatically deref to &str
ru: &amp;String может автоматически отменить ссылку на &ampstr

source: &T
ru: &amp;T

source: &T → &mut T
ru: &amp;T → &amp;mut T

source: &T → T
ru: &amp;T → T

source: &T can be safely shared between threads
ru: &amp;T может быть безопасно разделен между потоками

source: &v yields &T
ru: &amp;v выход &amp;T

source: &Vec<T>
ru: &ampVec<T>

source: # is not for comments (used for attributes)
ru: # это не for комментарии (использовались for атрибуты)

source: # this is a comment
ru: # это комментарий

source: #[ignore] excludes the test from default run
ru: #[ignore] исключает test из выполнения по умолчанию

source: #[macro_export] makes macro public when importing crate
ru: #[macro_export] делает macro общедоступным при импорте crate

source: #[non_exhaustive] allows adding fields or variants in a backwards compatible way
ru: #[не_исчерпывающий] позволяет добавлять поля или варианты in обратно совместимым способом

source: #[non_exhaustive] can be applied to individual enum variants as well as the enum itself
ru: #[не_исчерпывающий] может применяться к отдельным enum вариантам as, а также к as самому enum

source: #[repr(C)] for C-compatible layout
ru: #[repr(C)] for C-совместимая верстка

source: #[test] tells the test runner that this is a test
ru: #[test] сообщает исполнителю test, что это test

source: %% this is a comment
ru: %% это комментарий

source: + is fn add(self, s: &str) -> String, so s1 is moved
ru: + это fn add(self, s: &amp;str) -&gt; String, поэтому s1 перемещается

source: <1, "a", true>
ru: &lt;1, "a", true&gt;

source: | is the "or" operator for patterns, matches any of the specified patterns
ru: | - оператор "или" for шаблонов, соответствует любому из указанных шаблонов

source: 0x is valid prefix
ru: 0x - допустимый префикс

source: 1 byte ASCII
ru: 1 байт ASCII

source: 1:1 correspondence with OS thread
ru: переписка 1:1 с нитью ОС

source: 1..=3 gives 1..3, rev() → 3..1
ru: 1..=3 дает 1..3, rev() → 3..1

source: 2 bytes UTF-16
ru: 2 байта UTF-16

source: 4 bytes Unicode scalar value
ru: 4 байта Скалярное значение Unicode

source: 7 → 21. Each line creates a new x
ru: 7 → 21. Каждая строка создает новый x

source: 8 bits unsigned
ru: 8 бит без знака

source: 10x slower everywhere
ru: в 10 раз медленнее везде

source: 16-bit signed
ru: 16-битный подписанный

source: A bag of chars
ru: Мешок чар

source: A binary crate requires fn main() as the entry point
ru: Двоичный файл crate требует fn main () as точки входа

source: A bundle of one or more crates with a Cargo.toml
ru: Пакет из одного или нескольких ящиков с Cargo.toml

source: A Cargo.toml file
ru: Файл Cargo.toml

source: A channel for asynchronous message passing between futures
ru: Канал for для асинхронной передачи сообщений между фьючерсами

source: A child sees its parent
ru: Ребенок видит своего родителя

source: A class should be as small as possible
ru: Класс должен быть as небольшим as по возможности

source: A class should have multiple responsibilities
ru: У класса должно быть несколько обязанностей

source: A class should never change
ru: Класс никогда не должен меняться

source: A class should only have a single responsibility
ru: У класса должна быть только одна ответственность

source: A class with inheritance
ru: Класс с наследованием

source: A closure that modifies an external variable implements:
ru: Закрытие, изменяющее внешнюю переменную, реализует:

source: A closure that moves a value from the environment implements:
ru: Закрытие, которое перемещает значение из среды, реализует:

source: A compile-time optimization
ru: Оптимизация при компиляции

source: A component should behave in a way that most users expect
ru: Компонент должен вести себя in так, как ожидает большинство пользователей

source: A constructor via new. Rust has no built-in constructors
ru: Конструктор через new. В Rust нет встроенныхin конструкторов

source: A copied range
ru: Скопированный диапазон

source: A copy of the bytes
ru: Копия байтов

source: A crate is the minimal compilation unit. Even a single .rs file compiles as a crate
ru: crate - это минимальная единица компиляции. Даже один файл .rs компилирует as a crate

source: A data flow type
ru: Поток данных type

source: A data structure the compiler generates to track async block state
ru: Структура данных, создаваемая компилятором для отслеживания состояния блока async

source: A data type
ru: A данные type

source: A data type for working with dates
ru: Данные type for работа с датами

source: A database type
ru: База данных type

source: A default is added automatically
ru: Значение по умолчанию добавляется автоматически

source: A Deserializer implementation
ru: Реализация десериализатора

source: A dynamic heap array
ru: Массив динамической кучи

source: A dynamic type enabling heterogeneous types via a common trait
ru: Динамический type, позволяющий использовать разнородные типы через общий trait

source: A file extension
ru: Расширение файла

source: A fixed-length string
ru: Строка фиксированной длины

source: A fixed-size stack array
ru: Массив стеков фиксированного размера

source: A function pointer
ru: Указатель функции

source: A function that runs immediately
ru: Функция, которая запускается немедленно

source: A function without self
ru: Функция без self

source: A function works only in main
ru: Функция работает только in main

source: A Future
ru: Будущее

source: A Future represents a value that might be unavailable now but will become available later
ru: Future представляет значение, которое может быть недоступно сейчас, но будет become доступно позже

source: A generic type converter
ru: Общий конвертер type

source: A group of modules
ru: Группа модулей

source: A handle you can await to get the task's result
ru: Ручка, с помощью которой вы можете await получить результат задачи

source: A legitimate polymorphism technique
ru: Легитимная техника полиморфизма

source: A lib module
ru: Модуль lib

source: A library crate is defined in src/lib.rs
ru: Определена библиотека crate in src/lib.rs

source: A library that orchestrates asynchronous code
ru: Библиотека для организации асинхронного кода

source: A load-balancing mechanism that moves tasks between threads for performance
ru: Механизм балансировки нагрузки, который перемещает задачи между потоками for

source: A main entry point
ru: Точка входа main

source: A main function
ru: Функция main

source: A marker that a type can be safely moved even when pinned
ru: Маркер, указывающий на то, что type можно безопасно перемещать, даже если он прижат

source: A method always returns self
ru: Метод всегда возвращает self

source: A method is a function bound to a type. self is the first parameter
ru: Метод - это функция, привязанная к адресу type. self - это первый параметр

source: A method is always public
ru: Метод всегда является публичным

source: A method is inside impl and takes self
ru: Метод находится внутри impl и принимает self

source: A network connection
ru: Сетевое подключение

source: A new crate
ru: Новый crate

source: A new let can have a different type - it's actually a new variable
ru: Новый let может иметь другой type - это фактически новая переменная

source: A new String
ru: Новый String

source: A new struct
ru: Новый struct

source: A new thread is generated
ru: Создается новый поток

source: A non-owning reference to a contiguous region of data
ru: Несобственная ссылка на смежную область данных

source: A package is a set of crates + Cargo.toml describing how to build them
ru: Пакет - это набор ящиков + Cargo.toml, описывающий, как их собрать

source: A package is a set of workspaces
ru: Пакет - это набор рабочих пространств

source: A package may contain many binary crates but only one library crate
ru: Пакет может содержать множество бинарных ящиков, но только одну библиотеку crate

source: A package of data and procedures operating on that data
ru: Пакет данных и процедур, работающих с этими данными

source: A panic stops execution; default behavior is unwinding
ru: Паника останавливает выполнение; поведение по умолчанию - разматывание

source: A parent cannot access a child's private items, but the child can access the parent
ru: Родитель не может получить доступ к личным вещам ребенка, но ребенок может получить доступ к родительским

source: A parent sees a child's private items
ru: Родитель видит личные вещи ребенка

source: A physical device
ru: Физическое устройство

source: A point where a future may be suspended and later resumed
ru: Точка where будущее может быть приостановлено, а затем возобновлено

source: A pointer to a type implementing a trait, with a method table
ru: Указатель на type, реализующий trait, с таблицей методов

source: A pointer to the start and a length
ru: Указатель на начало и длину

source: A private field forces users to use constructors and prevents exhaustive pattern matching
ru: Закрытое поле заставляет пользователей использовать конструкторы use и предотвращает исчерпывающее сопоставление шаблонов

source: A reference always on the stack
ru: Ссылка всегда в стеке

source: A reference to already freed memory
ru: Ссылка на уже освобожденную память

source: A reference to an empty array
ru: Ссылка на пустой массив

source: A reference to another type
ru: Ссылка на другой type

source: A regular thread channel
ru: Обычный нитяной канал

source: A separate front_of_house module
ru: Отдельный модуль front_of_house

source: A separate package with dependencies
ru: Отдельный пакет с зависимостями

source: A set of compiler-checked rules for memory management
ru: Набор правил, проверяемых компилятором for Управление памятью

source: A simple type converter
ru: Простой конвертер type

source: A single fold method
ru: Метод одной складки

source: A smart pointer with auto-drop
ru: Интеллектуальный указатель с автоматическим падением

source: A sorting algorithm
ru: Алгоритм сортировки

source: A special numeric type
ru: Специальный цифровой type

source: A storage type
ru: A хранилище type

source: A struct adds semantics. Code becomes clearer
ru: Сайт struct добавляет семантику. Код становится более понятным

source: A struct groups data and methods. It's Rust's primary modeling tool
ru: Сайт struct группирует данные и методы. Это основной инструмент моделирования в Rust

source: A struct instance is created with { key: value }. There's no default constructor
ru: Экземпляр struct создается с помощью { key: value }. Конструктор по умолчанию отсутствует

source: A struct of only bools
ru: struct, состоящий только из логических чисел

source: A struct that behaves like a pointer and has additional behavior
ru: struct, который ведет себя как указатель и имеет дополнительное поведение

source: A struct that's always mut
ru: struct, который всегда mut

source: A struct with &str
ru: A struct with &ampstr

source: A struct with &T requires 'a
ru: Сайт struct с &amp;T требует 'a

source: A struct with a name but without field names
ru: struct с именем, но без имен полей

source: A struct with dynamic fields
ru: struct с динамическими полями

source: A struct with no fields
ru: struct без полей

source: A struct with one field
ru: struct с одним полем

source: A struct without fields
ru: Сайт struct без полей

source: A synonym for Future
ru: Синоним for Будущее

source: A synonym for Thread
ru: Синоним for Нить

source: A task ID
ru: Идентификатор задачи

source: A task JoinHandle
ru: Задача JoinHandle

source: A test is considered failed if it panics
ru: Сайт test считается неудачным if он паникует

source: A thread handle
ru: Резьбовая рукоятка

source: A trait bound
ru: trait

source: A trait for removing Pin
ru: A trait for удаление штыря

source: A trait object contains a pointer to the instance and a table for trait method lookup
ru: Объект trait содержит указатель на экземпляр и таблицу for trait поиска методов

source: A trait with extra utility methods for Stream
ru: trait с дополнительными методами for Stream

source: A tuple (A, B)
ru: Кортеж (A, B)

source: A tuple struct with a single field wrapping another type
ru: Кортеж struct с одним полем, обернутым в другое type

source: A type alias
ru: Псевдоним type

source: A unit of concurrency managed by the runtime
ru: Единица параллелизма, управляемая средой выполнения

source: A UTF-8 string
ru: Строка в формате UTF-8

source: A UTF-16 string
ru: Строка в формате UTF-16

source: A value can have many owners
ru: У значения может быть много владельцев

source: A value may have no owner
ru: Значение может не иметь владельца

source: A value that may not be ready now but will be ready in the future
ru: Ценность, которая, возможно, не готова сейчас, но будет готова in будущем

source: A value transformer between two fixed types
ru: Трансформатор значений между двумя фиксированными типами

source: A Vec with one element
ru: A Vec с одним элементом

source: A vector is homogeneous; an enum unifies variants under one type
ru: Вектор является однородным; enum объединяет варианты под одним type

source: A visitor implementation
ru: Реализация посетителя

source: A way to cancel tasks
ru: Способ отмены заданий

source: A workspace
ru: Рабочее пространство

source: A workspace = binaries only
ru: Рабочая область = только двоичные файлы

source: A workspace is a collection of multiple packages
ru: Рабочее пространство - это набор из нескольких пакетов

source: A workspace is a set of packages
ru: Рабочее пространство - это набор пакетов

source: A wrapper around Vec<u8>
ru: Обертка вокруг Vec&lt;u8&gt

source: A zero value
ru: Нулевое значение

source: Ability to bypass borrow checker everywhere
ru: Возможность обойти проверку заемщика повсюду

source: Ability to change internal value with externally immutable container
ru: Возможность изменения внутреннего значения с помощью внешнего неизменяемого контейнера

source: Ability to use Option
ru: Способность к use Option

source: About [i32; 5]:
ru: О [i32; 5]:

source: About comments:
ru: О комментариях:

source: About continue:
ru: О сайте continue:

source: About for in Rust:
ru: О сайте for in Rust:

source: About for:
ru: О сайте for:

source: About if/else as an expression:
ru: О if/else as выражении:

source: About keywords:
ru: О ключевых словах:

source: About rev():
ru: О rev():

source: About tuples:
ru: О кортежах:

source: About usize:
ru: О сайте usize:

source: About while:
ru: О сайте while:

source: Abstract class
ru: Абстрактный класс

source: Abstract classes
ru: Абстрактные классы

source: Abstract function
ru: Абстрактная функция

source: Abstract type
ru: Аннотация type

source: Abstraction and type safety
ru: Абстракция и безопасность type

source: Accept &&String
ru: Принять &amp;&ampString

source: Accept &Box<String>
ru: Принять иBox&lt;String&gt

source: Accept &mut String and pass &mut s
ru: Примите &amp;mut String и передайте &amp;mut s

source: Accept String
ru: Принять String

source: Accepts an arbitrary number of futures
ru: Принимает произвольное количество фьючерсов

source: Accepts only 2 futures
ru: Принимает только 2 фьючерса

source: Accessing a[10] when length is 5:
ru: Доступ к a[10], когда длина равна 5:

source: Accessing immutable static variable is safe
ru: Доступ к неизменяемой переменной static безопасен

source: According to the "Gang of Four" definition, what is an object?
ru: Согласно определению "Банды четырех", что такое объект?

source: Adapter returns a new iterator without consuming the original
ru: Адаптер возвращает новый итератор без использования исходного

source: Add to Cargo.toml
ru: Добавить в Cargo.toml

source: Adding a private field
ru: Добавление приватного поля

source: Additional if condition after pattern in match
ru: Дополнительное условие if после шаблона in match

source: Adds a dependency
ru: Добавляет зависимость

source: Adds an index to each element
ru: Добавляет индекс к каждому элементу

source: Adds thread safety
ru: Повышает безопасность резьбы

source: Advanced Features in Rust
ru: Дополнительные возможности in Rust

# advanced_features_link
source: https://doc.rust-lang.org/book/ch20-04-advanced-functions-and-closures.html
ru: https://doc.rust-lang.ru/book/ch19-00-advanced-features.html

source: After compilation they add no overhead
ru: После компиляции они не добавляют никаких накладных расходов

source: After its last use
ru: После своего последнего use

source: After parsing completes
ru: После завершения разбора

source: After the end, iterator returns None
ru: После завершения итератор возвращается None

source: After the expression (postfix)
ru: После выражения (постфикс)

source: AI programming
ru: Программирование ИИ

source: Aliasing
ru: Сглаживание

source: alive()
ru: живой()

source: all
ru: все

source: All above
ru: Все вышеперечисленное

source: All are compile-time generics
ru: Все они являются дженериками времени компиляции

source: All are data types
ru: Все они являются типами данных

source: All are runtime abstractions
ru: Все они являются абстракциями времени выполнения

source: All are syntactic sugar
ru: Все они являются синтаксическим сахаром

source: All Cow types
ru: Все типы коров

source: All elements are dropped
ru: Все элементы сброшены

source: All enum variants become public
ru: Все варианты enum become public
